# IFCParameter Template Get Or Create In Session Template Method

Source: https://www.revitapidocs.com/2026/ba19254e-78a9-b66a-e3cd-efe09de2a112.htm

---

| IFCParameter Template Get Or Create In Session Template Method |
| --- |

Gets the in\-session non\-serializable template or create new.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IFCParameterTemplate GetOrCreateInSessionTemplate(
	Document document
)
```

```
Public Shared Function GetOrCreateInSessionTemplate (
	document As Document
) As IFCParameterTemplate
```

```
public:
static IFCParameterTemplate^ GetOrCreateInSessionTemplate(
	Document^ document
)
```

```
static member GetOrCreateInSessionTemplate :
        document : Document -> IFCParameterTemplate
```

#### Parameters

document Document
:   The document where created mapping template is saved.

#### Return Value

IFCParameterTemplate
The mapping template. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace